# Data

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

![alt text](https://www.geeksforgeeks.org/wp-content/uploads/creating_dataframe1.png)

In [ ]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/weather_data.csv')

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.dtypes

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

In [ ]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}

df1=pd.DataFrame(weather_data)

In [ ]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df2=pd.read_csv('https://raw.githubusercontent.com/kelseyhightower/weather-data/master/weather.csv')

In [ ]:
df2.head()

   2000  11  30  23  00  6.65
0  2000  12   1   0   0  5.83
1  2000  12   1   1   0  5.06
2  2000  12   1   2   0  4.35
3  2000  12   1   3   0  3.68
4  2000  12   1   4   0  3.20

In [ ]:
df3=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/pandas_tutorial_read.csv',sep=';')

In [ ]:
df3

      2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
0     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
1     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
2     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
3     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
4     2018-01-01 00:05:42  read  country_6  2458151266   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1789  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1790  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1791  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1792  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1793  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1794 rows x 6 columns]

In [ ]:
df2=pd.read_csv('https://raw.githubusercontent.com/kelseyhightower/weather-data/master/weather.csv'
,names=['col1','col2','col3','col4','col5','col6'])

In [ ]:
df2

        col1  col2  col3  col4  col5  col6
0       2000    11    30    23     0  6.65
1       2000    12     1     0     0  5.83
2       2000    12     1     1     0  5.06
3       2000    12     1     2     0  4.35
4       2000    12     1     3     0  3.68
...      ...   ...   ...   ...   ...   ...
149995  2018     1    10    18     0  6.74
149996  2018     1    10    19     0  6.08
149997  2018     1    10    20     0  6.39
149998  2018     1    10    21     0  5.76
149999  2018     1    10    22     0  4.05

[150000 rows x 6 columns]

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.set_index('day')

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.set_index('day',inplace=True)

#df=df.set_index('day')

In [ ]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [ ]:
df['windspeed']

0    6
1    7
2    2
3    7
4    4
5    2
Name: windspeed, dtype: int64

In [ ]:
df['temperature']=df['temperature']+1

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           33          6   Rain
1  1/2/2017           36          7  Sunny
2  1/3/2017           29          2   Snow
3  1/4/2017           25          7   Snow
4  1/5/2017           33          4   Rain
5  1/6/2017           32          2  Sunny

In [ ]:
df[['temperature','event']]

   temperature  event
0           33   Rain
1           36  Sunny
2           29   Snow
3           25   Snow
4           33   Rain
5           32  Sunny

In [ ]:
df.event

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [ ]:
df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [ ]:
df.rename(columns={'event':'EVENT','day':'Date'},inplace=True)

In [ ]:
df

       Date  temperature  windspeed  EVENT
0  1/1/2017           33          6   Rain
1  1/2/2017           36          7  Sunny
2  1/3/2017           29          2   Snow
3  1/4/2017           25          7   Snow
4  1/5/2017           33          4   Rain
5  1/6/2017           32          2  Sunny

In [ ]:
df.dtypes

Date           object
temperature     int64
windspeed       int64
EVENT          object
dtype: object

In [ ]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     31.333333   4.666667
std       3.829708   2.338090
min      25.000000   2.000000
25%      29.750000   2.500000
50%      32.500000   5.000000
75%      33.000000   6.750000
max      36.000000   7.000000

In [ ]:
df.describe(include='all')

            Date  temperature  windspeed EVENT
count          6     6.000000   6.000000     6
unique         6          NaN        NaN     3
top     1/6/2017          NaN        NaN  Rain
freq           1          NaN        NaN     2
mean         NaN    31.333333   4.666667   NaN
std          NaN     3.829708   2.338090   NaN
min          NaN    25.000000   2.000000   NaN
25%          NaN    29.750000   2.500000   NaN
50%          NaN    32.500000   5.000000   NaN
75%          NaN    33.000000   6.750000   NaN
max          NaN    36.000000   7.000000   NaN

In [ ]:
df['EVENT'].value_counts()

Rain     2
Snow     2
Sunny    2
Name: EVENT, dtype: int64

In [ ]:
df['Date'].value_counts()

1/6/2017    1
1/5/2017    1
1/4/2017    1
1/2/2017    1
1/1/2017    1
1/3/2017    1
Name: Date, dtype: int64

In [ ]:
df.drop(['EVENT'],axis=1,inplace=True)

In [ ]:
df

       Date  temperature  windspeed
0  1/1/2017           33          6
1  1/2/2017           36          7
2  1/3/2017           29          2
3  1/4/2017           25          7
4  1/5/2017           33          4
5  1/6/2017           32          2

In [ ]:
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/weather_data.csv')

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.drop(['temperature','windspeed'],axis=1)

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df.drop(columns=['temperature','windspeed'],axis=1)

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [ ]:
df.drop(df.columns=[[0,1]],axis=1)

SyntaxError: ignored

In [ ]:
shape
dtypes
value_counts
drop
describe
info
set_index
reset_index
inplace

In [ ]:
df1=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_1.csv')

In [ ]:
df1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df2=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_2.csv')

In [ ]:
df2

   2   1500        Good   300000
0  3   1300        Fair   240000
1  3   1900   Very good   450000
2  3   1850         Bad   280000
3  2   1640        Good   310000

In [ ]:
df2=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_2.csv',header=None)

In [ ]:
df2

   0     1           2       3
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

In [ ]:
df2=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_2.csv',
                header=None,names=['Bedroom','Sq. foot','Locality','Price ($)'])

In [ ]:
df2

   Bedroom  Sq. foot    Locality  Price ($)
0        2      1500        Good     300000
1        3      1300        Fair     240000
2        3      1900   Very good     450000
3        3      1850         Bad     280000
4        2      1640        Good     310000

In [ ]:
df3=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_3.csv')

In [ ]:
df3

  Bedroom; Sq. foot; Locality; Price ($)
0                  2; 1500; Good; 300000
1                  3; 1300; Fair; 240000
2             3; 1900; Very good; 450000
3                   3; 1850; Bad; 280000
4                  2; 1640; Good; 310000

In [ ]:
df3=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_3.csv',sep=';')

In [ ]:
df3

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df4=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skiprows.csv')

In [ ]:
df4

  Filetype: CSV              Unnamed: 1  Unnamed: 2  Unnamed: 3
0           NaN  Info about some houses         NaN         NaN
1       Bedroom                Sq. foot    Locality   Price ($)
2             2                    1500        Good      300000
3             3                    1300        Fair      240000
4             3                    1900   Very good      450000
5             3                    1850         Bad      280000
6             2                    1640        Good      310000

In [ ]:
df4=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skiprows.csv',skiprows=2)

In [ ]:
df4

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df5=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skipfooter.csv',skiprows=2,engine='python')

In [ ]:
df5

   Bedroom                  Sq. foot    Locality   Price ($)
0      2.0                      1500        Good    300000.0
1      3.0                      1300        Fair    240000.0
2      3.0                      1900   Very good    450000.0
3      3.0                      1850         Bad    280000.0
4      2.0                      1640        Good    310000.0
5      NaN   This is the end of file         NaN         NaN

In [ ]:
df5=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_skipfooter.csv',skiprows=2,skipfooter=1,engine='python')

In [ ]:
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

In [ ]:
df=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/weather_data.csv',nrows=2)

In [ ]:
import pandas as pd
df=pd.read_csv('/content/drive/My Drive/FoDS-2021/data/CSV_EX_blankline.csv',skip_blank_lines=False)

In [ ]:
df

   Bedroom   Sq. foot    Locality   Price ($)
0      2.0     1500.0        Good    300000.0
1      3.0     1300.0        Fair    240000.0
2      NaN        NaN         NaN         NaN
3      3.0     1900.0   Very good    450000.0
4      3.0     1850.0         Bad    280000.0
5      NaN        NaN         NaN         NaN
6      2.0     1640.0        Good    310000.0

In [ ]:
df1=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv')

In [ ]:
df1.head()

                    company  rank  ...  employees  total_stockholder_equity
0                   Walmart     1  ...    2300000                     77798
1                State Grid     2  ...     926067                    209456
2             Sinopec Group     3  ...     713288                    106523
3  China National Petroleum     4  ...    1512048                    301893
4              Toyota Motor     5  ...     364445                    157210

[5 rows x 17 columns]

In [ ]:
df1=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv'
,index_col=0)

In [ ]:
df1.head()

                          rank  revenues  ...  employees  total_stockholder_equity
company                                   ...
Walmart                      1    485873  ...    2300000                     77798
State Grid                   2    315199  ...     926067                    209456
Sinopec Group                3    267518  ...     713288                    106523
China National Petroleum     4    262573  ...    1512048                    301893
Toyota Motor                 5    254694  ...     364445                    157210

[5 rows x 16 columns]

In [ ]:
df1=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv'
,index_col=[0,1])

In [ ]:
df1=pd.read_csv('https://raw.githubusercontent.com/sams248/DataQuest/master/Missions/2.%20Data%20Analysis%20and%20Visualisation/1.%20Pandas%20and%20NumPy%20Fundamentals/3.%20Introduction%20to%20Pandas/f500.csv'
,index_col=['company','rank'])

In [ ]:
df1.head()

                               revenues  ...  total_stockholder_equity
company                  rank            ...
Walmart                  1       485873  ...                     77798
State Grid               2       315199  ...                    209456
Sinopec Group            3       267518  ...                    106523
China National Petroleum 4       262573  ...                    301893
Toyota Motor             5       254694  ...                    157210

[5 rows x 15 columns]

In [ ]:
df2=pd.read_excel("/content/drive/MyDrive/FoDS-2021/data/Housing_data.xlsx",sheet_name='Data_Tab_2')

In [ ]:
df2

      CRIM    ZN  INDUS  CHAS    NOX  ...  TAX  PTRATIO       B  LSTAT  PRICE
0  0.17004  12.5   7.87     0  0.524  ...  311     15.2  386.71  17.10   18.9
1  0.22489  12.5   7.87     0  0.524  ...  311     15.2  392.52  20.45   15.0
2  0.11747  12.5   7.87     0  0.524  ...  311     15.2  396.90  13.27   18.9
3  0.09378  12.5   7.87     0  0.524  ...  311     15.2  390.50  15.71   21.7

[4 rows x 14 columns]

In [ ]:
df2=pd.read_excel("/content/drive/MyDrive/FoDS-2021/data/Housing_data.xlsx",sheet_name=None)

In [ ]:
df2

{'Data_Tab_1':       CRIM    ZN  INDUS  CHAS    NOX  ...  TAX  PTRATIO       B  LSTAT  PRICE
 0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98   24.0
 1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14   21.6
 2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03   34.7
 3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94   33.4
 4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33   36.2
 5  0.02985   0.0   2.18     0  0.458  ...  222     18.7  394.12   5.21   28.7
 6  0.08829  12.5   7.87     0  0.524  ...  311     15.2  395.60  12.43   22.9
 7  0.14455  12.5   7.87     0  0.524  ...  311     15.2  396.90  19.15   27.1
 8  0.21124  12.5   7.87     0  0.524  ...  311     15.2  386.63  29.93   16.5

 [9 rows x 14 columns],
 'Data_Tab_2':       CRIM    ZN  INDUS  CHAS    NOX  ...  TAX  PTRATIO       B  LSTAT  PRICE
 0  0.17004  12.5   7.87     0  0.524  ...  311     15.2  386.71  17.10   18.9
 1  0.22489  12.5   7.87     0  0.524  ...  311     15.2  392.52  20.45   15.0
 2  0.11747  12.5   7.87     0  0.524  ...  311     15.2  396.90  13.27   18.9
 3  0.09378  12.5   7.87     0  0.524  ...  311     15.2  390.50  15.71   21.7

 [4 rows x 14 columns],
 'Data_Tab_3':        CRIM  ZN  INDUS  CHAS    NOX  ...  TAX  PTRATIO       B  LSTAT  PRICE
 0   0.72580   0   8.14     0  0.538  ...  307       21  390.95  11.28   18.2
 1   1.25179   0   8.14     0  0.538  ...  307       21  376.57  21.02   13.6
 2   0.85204   0   8.14     0  0.538  ...  307       21  392.53  13.83   19.6
 3   1.23247   0   8.14     0  0.538  ...  307       21  396.90  18.72   15.2
 4   0.98843   0   8.14     0  0.538  ...  307       21  394.54  19.88   14.5
 5   0.75026   0   8.14     0  0.538  ...  307       21  394.33  16.30   15.6
 6   0.84054   0   8.14     0  0.538  ...  307       21  303.42  16.51   13.9
 7   0.67191   0   8.14     0  0.538  ...  307       21  376.88  14.81   16.6
 8   0.95577   0   8.14     0  0.538  ...  307       21  306.38  17.28   14.8
 9   0.77299   0   8.14     0  0.538  ...  307       21  387.94  12.80   18.4
 10  0.62976   0   8.14     0  0.538  ...  307       21  396.90   8.26   20.4
 11  0.63796   0   8.14     0  0.538  ...  307       21  380.02  10.26   18.2
 12  0.62739   0   8.14     0  0.538  ...  307       21  395.62   8.47   19.9
 13  1.05393   0   8.14     0  0.538  ...  307       21  386.85   6.58   23.1
 14  0.78420   0   8.14     0  0.538  ...  307       21  386.75  14.67   17.5
 15  0.80271   0   8.14     0  0.538  ...  307       21  288.99  11.69   20.2

 [16 rows x 14 columns]}

In [ ]:
df2.keys()

dict_keys(['Data_Tab_1', 'Data_Tab_2', 'Data_Tab_3'])

In [ ]:
import pandas as pd
data=pd.read_csv('https://s3-eu-west-1.amazonaws.com/shanebucket/downloads/uk-500.csv')

In [ ]:
data.head()

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

![alt text](https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2016/10/Pandas-selections-and-indexing-768x549.png)

In [ ]:
data.iloc[0]

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [ ]:
data.iloc[1]

first_name                                   Evan
last_name                               Zigomalas
company_name                   Cap Gemini America
address                               5 Binney St
city                                   Abbey Ward
county                            Buckinghamshire
postal                                   HP11 2AX
phone1                               01937-864715
phone2                               01714-737668
email                    evan.zigomalas@gmail.com
web             http://www.capgeminiamerica.co.uk
Name: 1, dtype: object

In [ ]:
data.iloc[-1]

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

In [ ]:
data.tail()

    first_name  ...                                          web
495      Avery  ...    http://www.plazagourmetdelicatessen.co.uk
496       Reid  ...           http://www.fitzgeraldedwardj.co.uk
497  Charlette  ...             http://www.fureyassociates.co.uk
498  Celestina  ...       http://www.bfgfederalcreditunion.co.uk
499         Mi  ...  http://www.nelsonwrighthaworthgolfcrs.co.uk

[5 rows x 11 columns]

In [ ]:
data.iloc[:,0]

0        Aleshia
1           Evan
2         France
3        Ulysses
4         Tyisha
         ...
495        Avery
496         Reid
497    Charlette
498    Celestina
499           Mi
Name: first_name, Length: 500, dtype: object

In [ ]:
data.iloc[:,1]

0      Tomkiewicz
1       Zigomalas
2         Andrade
3       Mcwalters
4          Veness
          ...
495          Veit
496       Euresti
497      Brenning
498         Keeny
499        Richan
Name: last_name, Length: 500, dtype: object

In [ ]:
data.iloc[0:10]

  first_name  ...                                       web
0    Aleshia  ...      http://www.alandrosenburgcpapc.co.uk
1       Evan  ...         http://www.capgeminiamerica.co.uk
2     France  ...          http://www.elliottjohnwesq.co.uk
3    Ulysses  ...              http://www.mcmahanbenl.co.uk
4     Tyisha  ...            http://www.champagneroom.co.uk
5       Eric  ...      http://www.thompsonmichaelcesq.co.uk
6       Marg  ...  http://www.wranglehillautoauctslvg.co.uk
7    Laquita  ...      http://www.incommunicationsinc.co.uk
8       Lura  ...            http://www.bizerbausainc.co.uk
9     Yuette  ...                 http://www.maxvideo.co.uk

[10 rows x 11 columns]

In [ ]:
data.iloc[:,0:2]

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

In [ ]:
data.iloc[0:5,0:2]

  first_name   last_name
0    Aleshia  Tomkiewicz
1       Evan   Zigomalas
2     France     Andrade
3    Ulysses   Mcwalters
4     Tyisha      Veness

In [ ]:
data.iloc[3:5,3:5]

             address                        city
3      505 Exeter Rd          Hawerby cum Beesby
4  5396 Forth Street  Greets Green and Lyng Ward

In [ ]:
data.iloc[[0,3,5,7],[0,5,6]]

  first_name            county    postal
0    Aleshia              Kent   CT2 7PP
3    Ulysses      Lincolnshire  DN36 5RP
5       Eric  Northamptonshire  NN14 2GH
7    Laquita       Tyne & Wear  NE29 7AD

In [ ]:
data.set_index("last_name",inplace=True)

In [ ]:
data.head(3)

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
Zigomalas        Evan  ...     http://www.capgeminiamerica.co.uk
Andrade        France  ...      http://www.elliottjohnwesq.co.uk

[3 rows x 10 columns]

In [ ]:
data.loc['Tomkiewicz':'Andrade']

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
Zigomalas        Evan  ...     http://www.capgeminiamerica.co.uk
Andrade        France  ...      http://www.elliottjohnwesq.co.uk

[3 rows x 10 columns]

In [ ]:
data.loc['Tomkiewicz':'Andrade','address':'phone1']

                 address  ...        phone1
last_name                 ...
Tomkiewicz  14 Taylor St  ...  01835-703597
Zigomalas    5 Binney St  ...  01937-864715
Andrade     8 Moor Place  ...  01347-368222

[3 rows x 5 columns]

In [ ]:
data.iloc[0:5]

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
Zigomalas        Evan  ...     http://www.capgeminiamerica.co.uk
Andrade        France  ...      http://www.elliottjohnwesq.co.uk
Mcwalters     Ulysses  ...          http://www.mcmahanbenl.co.uk
Veness         Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 10 columns]

In [ ]:
data.loc[data['first_name']=='Antonio']

           first_name  ...                                    web
last_name              ...
Villamarin    Antonio  ...       http://www.combssheetmetal.co.uk
Glasford      Antonio  ...  http://www.saintthomascreations.co.uk
Heilig        Antonio  ...    http://www.radissonsuitehotel.co.uk

[3 rows x 10 columns]

In [ ]:
data['first_name']=='Antonio'

last_name
Tomkiewicz    False
Zigomalas     False
Andrade       False
Mcwalters     False
Veness        False
              ...
Veit          False
Euresti       False
Brenning      False
Keeny         False
Richan        False
Name: first_name, Length: 500, dtype: bool

In [ ]:
data.loc[data['first_name']=='Antonio',['city','email']]

                                      city                            email
last_name
Villamarin  Little Parndon and Hare Street     antonio.villamarin@gmail.com
Glasford                    Gaer Community  antonio_glasford@glasford.co.uk
Heilig                            Ipplepen         antonio.heilig@gmail.com

In [ ]:
data.dtypes

first_name      object
company_name    object
address         object
city            object
county          object
postal          object
phone1          object
phone2          object
email           object
web             object
dtype: object

In [ ]:
data.loc[(data['county']=='Kent') & (data['first_name']=='Aleshia')]

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk

[1 rows x 10 columns]

In [ ]:
data.loc[(data['county']=='Kent') | (data['first_name']=='Aleshia')]

            first_name  ...                                          web
last_name               ...
Tomkiewicz     Aleshia  ...         http://www.alandrosenburgcpapc.co.uk
Writer        Fernanda  ...             http://www.krassociatesinc.co.uk
Thurm         Brittani  ...    http://www.burgesssteelproductscorp.co.uk
Dease            Paola  ...      http://www.sunderlandpublishingco.co.uk
Crete             Luke  ...                  http://www.mdwrailway.co.uk
Yurich         Cheryll  ...    http://www.blainecostructuralmovers.co.uk
Wendorf          Galen  ...      http://www.russellameliamosleyesq.co.uk
Puskarich         Thad  ...           http://www.drubnernormansesq.co.uk
Geschke       Gabriele  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker       Jordan  ...         http://www.shirleysprintshoppe.co.uk
Dubberly       Madalyn  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd             Maia  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman    Christoper  ...            http://www.jonesbrighampesq.co.uk
Colamarino       Melda  ...         http://www.proctorassociatesco.co.uk
Mercik           Elden  ...                  http://www.leestandvm.co.uk
Flori          Pearlie  ...   http://www.marinesafetyinternational.co.uk
Maricle          Dusti  ...           http://www.gartonjeffreypesq.co.uk
Kernagis        Gerald  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater    Stefania  ...    http://www.murraywhisnantarchitects.co.uk
Farrin            Paul  ...             http://www.deringjameseesq.co.uk
Humeniuk          Viki  ...    http://www.guldstrandengineeringinc.co.uk
Tischner         Altha  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
data.loc[data['email'].str.endswith("hotmail.com")]

#startswith, contains,find

           first_name  ...                                          web
last_name              ...
Tomkiewicz    Aleshia  ...         http://www.alandrosenburgcpapc.co.uk
Andrade        France  ...             http://www.elliottjohnwesq.co.uk
Mcwalters     Ulysses  ...                 http://www.mcmahanbenl.co.uk
Veness         Tyisha  ...               http://www.champagneroom.co.uk
Grasmick         Marg  ...     http://www.wranglehillautoauctslvg.co.uk
...               ...  ...                                          ...
Gaucher        Sophia  ...               http://www.tcesystemsinc.co.uk
Ausdemore      Rosita  ...              http://www.jurdemscottesq.co.uk
Stancil          Huey  ...                http://www.lindnerfunds.co.uk
Fiorino        Elbert  ...            http://www.donaldgnelsonesq.co.uk
Richan             Mi  ...  http://www.nelsonwrighthaworthgolfcrs.co.uk

[114 rows x 10 columns]

In [ ]:
# all gmail users with first name Antonio

In [ ]:
data.loc[data['first_name'].isin(['France','Tyisha','Eric'])]  

#

          first_name  ...                                   web
last_name             ...
Andrade       France  ...      http://www.elliottjohnwesq.co.uk
Veness        Tyisha  ...        http://www.champagneroom.co.uk
Rampy           Eric  ...  http://www.thompsonmichaelcesq.co.uk

[3 rows x 10 columns]

In [ ]:
data.loc[(data['first_name']=='France') | (data['first_name']=='Tyisha') | (data['first_name']=='Eric')]

          first_name  ...                                   web
last_name             ...
Andrade       France  ...      http://www.elliottjohnwesq.co.uk
Veness        Tyisha  ...        http://www.champagneroom.co.uk
Rampy           Eric  ...  http://www.thompsonmichaelcesq.co.uk

[3 rows x 10 columns]

In [ ]:
data.loc[(data['county']=='Kent'),['first_name']]='Dhanya'

In [ ]:
data.loc[(data['county']=='Kent')]

           first_name  ...                                          web
last_name              ...
Tomkiewicz     Dhanya  ...         http://www.alandrosenburgcpapc.co.uk
Writer         Dhanya  ...             http://www.krassociatesinc.co.uk
Thurm          Dhanya  ...    http://www.burgesssteelproductscorp.co.uk
Dease          Dhanya  ...      http://www.sunderlandpublishingco.co.uk
Crete          Dhanya  ...                  http://www.mdwrailway.co.uk
Yurich         Dhanya  ...    http://www.blainecostructuralmovers.co.uk
Wendorf        Dhanya  ...      http://www.russellameliamosleyesq.co.uk
Puskarich      Dhanya  ...           http://www.drubnernormansesq.co.uk
Geschke        Dhanya  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker      Dhanya  ...         http://www.shirleysprintshoppe.co.uk
Dubberly       Dhanya  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd          Dhanya  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman       Dhanya  ...            http://www.jonesbrighampesq.co.uk
Colamarino     Dhanya  ...         http://www.proctorassociatesco.co.uk
Mercik         Dhanya  ...                  http://www.leestandvm.co.uk
Flori          Dhanya  ...   http://www.marinesafetyinternational.co.uk
Maricle        Dhanya  ...           http://www.gartonjeffreypesq.co.uk
Kernagis       Dhanya  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater     Dhanya  ...    http://www.murraywhisnantarchitects.co.uk
Farrin         Dhanya  ...             http://www.deringjameseesq.co.uk
Humeniuk       Dhanya  ...    http://www.guldstrandengineeringinc.co.uk
Tischner       Dhanya  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
data.loc[(data.first_name)=='Dhanya',['company_name','city']]=['Amrita','Coimbatore']

In [ ]:
data.loc[data.first_name=='Dhanya']

           first_name  ...                                          web
last_name              ...
Tomkiewicz     Dhanya  ...         http://www.alandrosenburgcpapc.co.uk
Writer         Dhanya  ...             http://www.krassociatesinc.co.uk
Thurm          Dhanya  ...    http://www.burgesssteelproductscorp.co.uk
Dease          Dhanya  ...      http://www.sunderlandpublishingco.co.uk
Crete          Dhanya  ...                  http://www.mdwrailway.co.uk
Yurich         Dhanya  ...    http://www.blainecostructuralmovers.co.uk
Wendorf        Dhanya  ...      http://www.russellameliamosleyesq.co.uk
Puskarich      Dhanya  ...           http://www.drubnernormansesq.co.uk
Geschke        Dhanya  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker      Dhanya  ...         http://www.shirleysprintshoppe.co.uk
Dubberly       Dhanya  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd          Dhanya  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman       Dhanya  ...            http://www.jonesbrighampesq.co.uk
Colamarino     Dhanya  ...         http://www.proctorassociatesco.co.uk
Mercik         Dhanya  ...                  http://www.leestandvm.co.uk
Flori          Dhanya  ...   http://www.marinesafetyinternational.co.uk
Maricle        Dhanya  ...           http://www.gartonjeffreypesq.co.uk
Kernagis       Dhanya  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater     Dhanya  ...    http://www.murraywhisnantarchitects.co.uk
Farrin         Dhanya  ...             http://www.deringjameseesq.co.uk
Humeniuk       Dhanya  ...    http://www.guldstrandengineeringinc.co.uk
Tischner       Dhanya  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
data['first_name'].unique()

array(['Dhanya', 'Evan', 'France', 'Ulysses', 'Tyisha', 'Eric', 'Marg',
       'Laquita', 'Lura', 'Yuette', 'Charlesetta', 'Corrinne', 'Niesha',
       'Rueben', 'Michell', 'Edgar', 'Dewitt', 'Charisse', 'Mee', 'Peter',
       'Octavio', 'Martha', 'Tamesha', 'Tess', 'Leonard', 'Svetlana',
       'Pok', 'Augustine', 'Karma', 'Reed', 'German', 'Milly', 'Luis',
       'Ciara', 'Alethea', 'Margurite', 'Vernice', 'Vicente', 'Craig',
       'Jenise', 'Marylin', 'Marget', 'Annett', 'Kip', 'Melina', 'Tina',
       'Luisa', 'Pedro', 'Carrol', 'Alba', 'Domonique', 'Rory', 'Dustin',
       'Lyndia', 'Jules', 'Dong', 'Justine', 'Chantay', 'Tequila',
       'Maybelle', 'Margarett', 'Janessa', 'Sol', 'Louann', 'Lindsay',
       'Malika', 'Stefany', 'Abraham', 'Giuseppe', 'Kiera', 'Wendell',
       'Stevie', 'Yun', 'Billy', 'Brynn', 'Elroy', 'Anisha', 'Bettina',
       'Velda', 'Marta', 'Juan', 'Lelia', 'Una', 'Eva', 'Mammie',
       'Jeannetta', 'Elbert', 'Lenny', 'Mira', 'Cathern', 'Malcom',
       'Monroe', 'Leota', 'Berry', 'Meghan', 'Mike', 'Elsa', 'Linwood',
       'Latosha', 'Alexia', 'Graham', 'Elinore', 'Lisbeth', 'Eloisa',
       'Shawana', 'Alyssa', 'Kyoko', 'Terry', 'Sena', 'Cristen',
       'Lashawn', 'Wade', 'Whitney', 'Deja', 'Earnestine', 'Frankie',
       'Rodrigo', 'Luther', 'Casey', 'Ressie', 'Sean', 'Celestina',
       'Maira', 'Beth', 'Wei', 'Melissia', 'Letha', 'Isaac', 'Kristine',
       'Odette', 'Hobert', 'Isadora', 'Emily', 'Desire', 'Rosalind',
       'Vernell', 'Micheline', 'Nathan', 'Allene', 'Julie', 'Francisca',
       'Marisha', 'Telma', 'Hubert', 'Janella', 'Angelo', 'Tran',
       'Reynalda', 'Salley', 'Crista', 'Lino', 'Gilbert', 'Socorro',
       'Mauricio', 'Phillip', 'Gilberto', 'Bambi', 'Marshall', 'Chery',
       'Eileen', 'Melita', 'Ashley', 'Laila', 'Bobbie', 'Dana', 'Freida',
       'Val', 'Horace', 'Joana', 'Tiara', 'Dacia', 'Myong', 'Gene',
       'Kanisha', 'Ayesha', 'Lanie', 'Jaleesa', 'Tamekia', 'Ula',
       'Rosendo', 'Timmy', 'Zita', 'Aleisha', 'Naomi', 'Aretha', 'Mila',
       'Orville', 'Kara', 'Kenny', 'Vashti', 'Carisa', 'Audrie',
       'Shaunna', 'Coleen', 'Katie', 'Dannie', 'Ashanti', 'Santos',
       'Alyce', 'Pearly', 'Cherrie', 'Edwin', 'Leigha', 'Walker',
       'Nakita', 'Kattie', 'Lamar', 'Juliana', 'Chan', 'Delpha', 'Floyd',
       'Chantell', 'Martin', 'Hyun', 'Nada', 'Elizabeth', 'Dominic',
       'Alise', 'Flo', 'Bonita', 'Royal', 'Erasmo', 'Mari', 'Eleonora',
       'Therese', 'Rodolfo', 'Cruz', 'Arlyne', 'Edward', 'Margot',
       'Gerald', 'Tomoko', 'Mendy', 'Daryl', 'Ty', 'King', 'Isidra',
       'Tonja', 'Shaquana', 'Rex', 'Adolph', 'Queen', 'Rebbecca',
       'Ardella', 'Dallas', 'Vivan', 'Han', 'Emilio', 'Latia', 'Lilli',
       'Maryanne', 'Eliz', 'Laura', 'Leanora', 'Sherell', 'Charlie',
       'Veronique', 'Antonio', 'Louvenia', 'Roxanne', 'Eve', 'Kenda',
       'Kami', 'Selene', 'Deangelo', 'Olen', 'Lynna', 'Jody', 'Merilyn',
       'Elliott', 'Leonie', 'Eulah', 'Marsha', 'Mignon', 'Tu', 'Adelle',
       'Douglass', 'Evette', 'Geraldo', 'Clarinda', 'Reuben', 'Yen',
       'Tanja', 'Jerlene', 'Almeta', 'Wilda', 'Remedios', 'Margret',
       'Denny', 'Carolynn', 'Amina', 'Janna', 'Emiko', 'In', 'Eleni',
       'Kandis', 'Kina', 'Jacki', 'Fallon', 'Precious', 'Glory', 'Brande',
       'Olene', 'Carey', 'Launa', 'Dominga', 'Dwight', 'Cornell',
       'Alverta', 'Felicia', 'Carmen', 'Ashlee', 'Vannessa', 'Patti',
       'Anika', 'Cristina', 'Lemuel', 'Joaquin', 'Kerrie', 'Alaine',
       'Shannon', 'Corinne', 'Heidy', 'Marylyn', 'Maryln', 'Nina',
       'Vivienne', 'Jacob', 'Tula', 'Kaycee', 'Melvin', 'Brianne',
       'Eugene', 'Margery', 'Noel', 'Beula', 'Sheridan', 'Dino',
       'Rebbeca', 'Celia', 'Stefania', 'Leah', 'Doug', 'Veronica',
       'Laquanda', 'Mohammad', 'Mozell', 'Bronwyn', 'Jeff', 'Shantay',
       'Keneth', 'Alton', 'Patrick', 'Theron', 'Pilar', 'Lashunda',
       'Verda', 'Vesta', 'Emogene', 'Shayne', 'Franchesca', 'Elmira',
       'Destiny', 'Gaston', 'Ronna', 'Angelica', 'Casie', 'Magdalene',
       'Rosalia', 'Lyda', 'Lisandra', 'Sabina', 'Elenore', 'Leeann',
       'Janet', 'Lewis', 'Jestine', 'Tatum', 'Kayleigh', 'Lili',
       'Sunshine', 'Remona', 'Gail', 'Larue', 'Goldie', 'Shelia',
       'Narcisa', 'Evelynn', 'Arlean', 'Tamra', 'Aracelis', 'Filiberto',
       'Leana', 'Man', 'Lennie', 'Arletta', 'Chana', 'Nell', 'Sueann',
       'Alayna', 'Talia', 'Pansy', 'Royce', 'Cherelle', 'Dudley',
       'Nettie', 'Carline', 'Shanda', 'Lovetta', 'Felice', 'Margarita',
       'Anglea', 'Ona', 'Germaine', 'Vicky', 'Carolann', 'Rusty',
       'Cassandra', 'Teresita', 'Evangelina', 'Marlon', 'Quiana',
       'Domitila', 'Ivan', 'Anabel', 'Carlton', 'Rashida', 'Sherron',
       'Cora', 'Dortha', 'Diego', 'Peggy', 'Walton', 'Vallie', 'Tony',
       'Mel', 'Isabella', 'Ivory', 'Nikita', 'Aleta', 'Owen', 'Pauline',
       'Tijuana', 'Ahmad', 'Jamika', 'Derrick', 'Jacquelyne', 'Zachary',
       'Sophia', 'Isabelle', 'Ronnie', 'Krystina', 'Rosita', 'Huey',
       'Pura', 'Alesia', 'Avery', 'Reid', 'Charlette', 'Mi'], dtype=object)

In [ ]:
data['first_name'].nunique()

460

# FILL NA

In [ ]:
import pandas as pd
df=pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv')

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

In [ ]:
df['ST_NAME'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: ST_NAME, dtype: bool

In [ ]:
df['SQ_FT'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [ ]:
df.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
missing_values=["na","--"]
df=pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv'
,na_values=missing_values)

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.fillna("hello")

           PID ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH  SQ_FT
0  1.00001e+08    104      PUTNAM            Y            3        1   1000
1  1.00002e+08    197   LEXINGTON            N            3      1.5  hello
2  1.00003e+08  hello   LEXINGTON            N        hello        1    850
3  1.00004e+08    201    BERKELEY           12            1    hello    700
4        hello    203    BERKELEY            Y            3        2   1600
5  1.00006e+08    207    BERKELEY            Y        hello        1    800
6  1.00007e+08  hello  WASHINGTON        hello            2   HURLEY    950
7  1.00008e+08    213     TREMONT            Y            1        1  hello
8  1.00009e+08    215     TREMONT            Y        hello        2   1800

In [ ]:
df.fillna(method='ffill')

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5  1000.0
2  100003000.0   197.0   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0        1   700.0
4  100004000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0   207.0  WASHINGTON            Y           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1   950.0
8  100009000.0   215.0     TREMONT            Y           1.0        2  1800.0

In [ ]:
df.dropna()

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.dropna(how='all')

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.dropna(axis=1)

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
import numpy as np

df['OWN_OCCUPIED']=df['OWN_OCCUPIED'].replace('[0-9]+',np.nan,regex=True)

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df['NUM_BATH']=df['NUM_BATH'].replace('[A-Za-z]+',np.nan,regex=True)

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
mean=df['NUM_BATH'].mean()

In [ ]:
df['NUM_BATH'].fillna(mean)

0    1.000000
1    1.500000
2    1.000000
3    1.357143
4    2.000000
5    1.000000
6    1.357143
7    1.000000
8    2.000000
Name: NUM_BATH, dtype: float64

In [ ]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH         object
SQ_FT           float64
dtype: object

In [ ]:
df['NUM_BATH']=df['NUM_BATH'].astype(float)

In [ ]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH        float64
SQ_FT           float64
dtype: object

In [ ]:
df['NUM_BATH'].fillna(1.5)

0         1
1       1.5
2         1
3       1.5
4         2
5         1
6    HURLEY
7         1
8         2
Name: NUM_BATH, dtype: object

In [ ]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df.fillna(df.mean(),inplace=True)

# SORT

In [ ]:
df=pd.read_csv('http://bit.ly/2cLzoxH')

In [ ]:
df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [ ]:
df.sort_values('lifeExp')

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [ ]:
df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [ ]:
df.sort_values('lifeExp',ascending=False)

              country  year          pop continent  lifeExp     gdpPercap
803             Japan  2007  127467972.0      Asia   82.603  31656.068060
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
...               ...   ...          ...       ...      ...           ...
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
552            Gambia  1952     284320.0    Africa   30.000    485.230659
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595

[1704 rows x 6 columns]

In [ ]:
df.isnull().sum()

country      0
year         0
pop          0
continent    0
lifeExp      0
gdpPercap    0
dtype: int64

In [ ]:
df.sort_values('lifeExp',na_position='first')

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [ ]:
data=df.sort_values('lifeExp',na_position='first')

In [ ]:
data.head()

           country  year        pop continent  lifeExp    gdpPercap
1292        Rwanda  1992  7290203.0    Africa   23.599   737.068595
0      Afghanistan  1952  8425333.0      Asia   28.801   779.445314
552         Gambia  1952   284320.0    Africa   30.000   485.230659
36          Angola  1952  4232095.0    Africa   30.015  3520.610273
1344  Sierra Leone  1952  2143249.0    Africa   30.331   879.787736

In [ ]:
data.sort_index()

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [ ]:
df.sort_values(['lifeExp','gdpPercap'])

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

In [ ]:
df.sort_values(['lifeExp','gdpPercap'],ascending=[True,False])

              country  year          pop continent  lifeExp     gdpPercap
1292           Rwanda  1992    7290203.0    Africa   23.599    737.068595
0         Afghanistan  1952    8425333.0      Asia   28.801    779.445314
552            Gambia  1952     284320.0    Africa   30.000    485.230659
36             Angola  1952    4232095.0    Africa   30.015   3520.610273
1344     Sierra Leone  1952    2143249.0    Africa   30.331    879.787736
...               ...   ...          ...       ...      ...           ...
1487      Switzerland  2007    7554661.0    Europe   81.701  37506.419070
695           Iceland  2007     301931.0    Europe   81.757  36180.789190
802             Japan  2002  127065841.0      Asia   82.000  28604.591900
671   Hong Kong China  2007    6980412.0      Asia   82.208  39724.978670
803             Japan  2007  127467972.0      Asia   82.603  31656.068060

[1704 rows x 6 columns]

# N-Largest

In [ ]:
df = pd.DataFrame({'population': [58812491, 37522972, 339757,
                                  339757, 339757, 38964, 11646, 11646, 11646],
                   'GDP': [2033594, 1833594 , 153594, 14520, 10128,
                           836, 139, 39, 539],
                   'alpha-2': ["SA", "CA", "AU", "MV", "IS",
                               "MC", "NU", "TV", "PW"]},
                  index=["South Africa", "Canada", "Australia",
                         "Maldives", "Iceland", "Monaco", "Niue",
                         "Tuvalu", "Palau"])
df

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS
Monaco             38964      836      MC
Niue               11646      139      NU
Tuvalu             11646       39      TV
Palau              11646      539      PW

In [ ]:
df.nlargest(3,'population')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU

In [ ]:
df.nlargest(3,'population',keep='last')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Iceland           339757    10128      IS

In [ ]:
df.nlargest(3,'population',keep='all')

              population      GDP alpha-2
South Africa    58812491  2033594      SA
Canada          37522972  1833594      CA
Australia         339757   153594      AU
Maldives          339757    14520      MV
Iceland           339757    10128      IS

# Group_by

In [ ]:
df=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/7_group_by/weather_by_cities.csv')

In [ ]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
g=df.groupby('city')

In [ ]:
g

In [ ]:
g.first()

               day  temperature  windspeed  event
city
mumbai    1/1/2017           90          5  Sunny
new york  1/1/2017           32          6   Rain
paris     1/1/2017           45         20  Sunny

In [ ]:
g.get_group('mumbai')

        day  temperature  windspeed  event
4  1/1/2017           90          5  Sunny
5  1/2/2017           85         12    Fog
6  1/3/2017           87         15    Fog
7  1/4/2017           92          5   Rain

In [ ]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [ ]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
df = pd.DataFrame({
    'value':[20.45,22.89,32.12,111.22,33.22,100.00,99.99],
    'product':['table','chair','chair','mobile phone','table','mobile phone','table'],
    'price':[100,200,300,400,500,600,700]
})

In [ ]:
df

    value       product  price
0   20.45         table    100
1   22.89         chair    200
2   32.12         chair    300
3  111.22  mobile phone    400
4   33.22         table    500
5  100.00  mobile phone    600
6   99.99         table    700

In [ ]:
group_df=df.groupby('product').agg({'value':['min','max','mean']})

In [ ]:
group_df

               value
                 min     max     mean
product
chair          22.89   32.12   27.505
mobile phone  100.00  111.22  105.610
table          20.45   99.99   51.220

In [ ]:
group_df=df.groupby('product').agg({'value':['min','max','mean'],'price':['mean']})

In [ ]:
group_df

               value                        price
                 min     max     mean        mean
product
chair          22.89   32.12   27.505  250.000000
mobile phone  100.00  111.22  105.610  500.000000
table          20.45   99.99   51.220  433.333333

In [ ]:
group_df.columns = ['_'.join(col) for col in group_df.columns.values]

In [ ]:
group_df

              value_min  value_max  value_mean  price_mean
product
chair             22.89      32.12      27.505  250.000000
mobile phone     100.00     111.22     105.610  500.000000
table             20.45      99.99      51.220  433.333333

In [ ]:
group_df = group_df.reset_index()

In [ ]:
group_df

        product  value_min  value_max  value_mean  price_mean
0         chair      22.89      32.12      27.505  250.000000
1  mobile phone     100.00     111.22     105.610  500.000000
2         table      20.45      99.99      51.220  433.333333

In [ ]:
group_df['price_mean']

0    250.000000
1    500.000000
2    433.333333
Name: price_mean, dtype: float64

# merge

In [ ]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [ ]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [ ]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [ ]:
df3=pd.merge(df1,df2)

In [ ]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [ ]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [ ]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [ ]:
df5=pd.merge(df3,df4)

In [ ]:
df5

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [ ]:
df6 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

In [ ]:
df6

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [ ]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [ ]:
df7=pd.merge(df1,df6)

In [ ]:
df7

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [ ]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [ ]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [ ]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [ ]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [ ]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [ ]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [ ]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [ ]:
pd.merge(df1,df3,left_on="employee",right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [ ]:
pd.merge(df1,df3,left_on="employee",right_on="name").drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [ ]:
df1a=df1.set_index('employee')

In [ ]:
df2a=df2.set_index('employee')

In [ ]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [ ]:
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [ ]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [ ]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [ ]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [ ]:
pd.merge(df6,df7,how='inner')

   name   food drink
0  Mary  bread  wine

In [ ]:
pd.merge(df6,df7,how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [ ]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [ ]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [ ]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})

In [ ]:
pd.merge(df8,df9,on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [ ]:
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

#CONCAT

In [ ]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

NameError: ignored

In [ ]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [ ]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [1, 2])

In [ ]:
df1

    A   B
1  A1  B1
2  A2  B2

In [ ]:
df2

    A   B
1  A1  B1
2  A2  B2

In [ ]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
1  A1  B1
2  A2  B2

In [ ]:
pd.concat([df1, df2],axis=1)

    A   B   A   B
1  A1  B1  A1  B1
2  A2  B2  A2  B2

In [ ]:
pd.concat([df1, df2],ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A1  B1
3  A2  B2

In [ ]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

In [ ]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [ ]:
pd.concat([df1, df2],axis=1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [ ]:
df1 = make_df('AB', [1, 2])
df2 = make_df('CD', [3, 4])

In [ ]:
pd.concat([df1, df2])

     A    B    C    D
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   C3   D3
4  NaN  NaN   C4   D4

# Melt

## Basics

In [ ]:
import pandas as pd
df = pd.DataFrame({'New York': [25]})
df

   New York
0        25

In [ ]:
df.melt()

   variable  value
0  New York     25

In [ ]:
df = pd.DataFrame({'New york': [25], 'Paris': [27], 'London': [30]})
df

   New york  Paris  London
0        25     27      30

In [ ]:
df.melt()

   variable  value
0  New york     25
1     Paris     27
2    London     30

In [ ]:
df_larger = pd.DataFrame({
    'New york': [25, 27, 23, 25, 29],
    'Paris': [27, 22, 24, 26, 28],
    'London': [30, 31, 33, 29, 25]
})
df_larger

   New york  Paris  London
0        25     27      30
1        27     22      31
2        23     24      33
3        25     26      29
4        29     28      25

In [ ]:
df_larger.melt()

    variable  value
0   New york     25
1   New york     27
2   New york     23
3   New york     25
4   New york     29
5      Paris     27
6      Paris     22
7      Paris     24
8      Paris     26
9      Paris     28
10    London     30
11    London     31
12    London     33
13    London     29
14    London     25

In [ ]:
# var_name and value_name can be used to change the labels of the melted dataframe's columns.
df.melt(var_name='city', value_name='temperature')

       city  temperature
0  New york           25
1     Paris           27
2    London           30

In [ ]:
temperatures = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Berlin', 'Amsterdam'],
    'day1': [23, 25, 27, 26, 24],
    'day2': [22, 21, 25, 26, 23],
    'day3': [26, 25, 24, 27, 23],
    'day4': [23, 21, 22, 26, 27],
    'day5': [27, 26, 27, 24, 28]
})
temperatures

        city  day1  day2  day3  day4  day5
0   New York    23    22    26    23    27
1     London    25    21    25    21    26
2      Paris    27    25    24    22    27
3     Berlin    26    26    27    26    24
4  Amsterdam    24    23    23    27    28

In [ ]:
temperatures.melt()

   variable      value
0      city   New York
1      city     London
2      city      Paris
3      city     Berlin
4      city  Amsterdam
5      day1         23
6      day1         25
7      day1         27
8      day1         26
9      day1         24
10     day2         22
11     day2         21
12     day2         25
13     day2         26
14     day2         23
15     day3         26
16     day3         25
17     day3         24
18     day3         27
19     day3         23
20     day4         23
21     day4         21
22     day4         22
23     day4         26
24     day4         27
25     day5         27
26     day5         26
27     day5         27
28     day5         24
29     day5         28

In [ ]:
#If we want to turn only some of the columns into rows, pass the columns to keep as a list (even if it is a single value) to id_vars . id_vars stands for identity variables.
temperatures.melt(id_vars=['city'])

         city variable  value
0    New York     day1     23
1      London     day1     25
2       Paris     day1     27
3      Berlin     day1     26
4   Amsterdam     day1     24
5    New York     day2     22
6      London     day2     21
7       Paris     day2     25
8      Berlin     day2     26
9   Amsterdam     day2     23
10   New York     day3     26
11     London     day3     25
12      Paris     day3     24
13     Berlin     day3     27
14  Amsterdam     day3     23
15   New York     day4     23
16     London     day4     21
17      Paris     day4     22
18     Berlin     day4     26
19  Amsterdam     day4     27
20   New York     day5     27
21     London     day5     26
22      Paris     day5     27
23     Berlin     day5     24
24  Amsterdam     day5     28

In [ ]:
temperatures.melt(id_vars=['city'],
                  var_name='date',
                  value_name='temperature')

         city  date  temperature
0    New York  day1           23
1      London  day1           25
2       Paris  day1           27
3      Berlin  day1           26
4   Amsterdam  day1           24
5    New York  day2           22
6      London  day2           21
7       Paris  day2           25
8      Berlin  day2           26
9   Amsterdam  day2           23
10   New York  day3           26
11     London  day3           25
12      Paris  day3           24
13     Berlin  day3           27
14  Amsterdam  day3           23
15   New York  day4           23
16     London  day4           21
17      Paris  day4           22
18     Berlin  day4           26
19  Amsterdam  day4           27
20   New York  day5           27
21     London  day5           26
22      Paris  day5           27
23     Berlin  day5           24
24  Amsterdam  day5           28

In [ ]:
stocks = pd.read_csv('https://raw.githubusercontent.com/kyi3081/stock-analysis/master/prices-split-adjusted.csv',
                     usecols=['date', 'symbol', 'open', 'close'],
                     parse_dates=['date'],
                     index_col='date')
stocks.head()

           symbol        open       close
date
2016-01-05   WLTW  123.430000  125.839996
2016-01-06   WLTW  125.239998  119.980003
2016-01-07   WLTW  116.379997  114.949997
2016-01-08   WLTW  115.480003  116.620003
2016-01-11   WLTW  117.010002  114.970001

In [ ]:
stocks_small = stocks.loc['2016-02-01':'2016-03-01'].reset_index()
stocks_small.head()

        date symbol        open       close
0 2016-02-01   WLTW  114.000000  114.500000
1 2016-02-02   WLTW  113.250000  110.559998
2 2016-02-03   WLTW  113.379997  114.050003
3 2016-02-04   WLTW  114.080002  115.709999
4 2016-02-05   WLTW  115.120003  114.019997

In [ ]:
pivoted = stocks_small.pivot(index='symbol', columns='date')

In [ ]:
pivoted.head()

              open                          ...       close
date    2016-02-01  2016-02-02  2016-02-03  ...  2016-02-26  2016-02-29  2016-03-01
symbol                                      ...
A        37.369999   37.180000   37.270000  ...   37.590000   37.349998   38.590000
AAL      39.000000   38.830002   37.380001  ...   40.869999   41.000000   41.830002
AAP     151.699997  154.380005  151.580002  ...  150.050003  148.440002  153.350006
AAPL     96.470001   95.419998   95.000000  ...   96.910004   96.690002  100.529999
ABBV     54.160000   53.639999   54.529999  ...   56.000000   54.610001   56.340000

[5 rows x 42 columns]

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/melt/weather.csv')

In [ ]:
df

         day  chicago  chennai  berlin
0     Monday       32       75      41
1    Tuesday       30       77      43
2  Wednesday       28       75      45
3   Thursday       22       82      38
4     Friday       30       83      30
5   Saturday       20       81      45
6     Sunday       25       77      47

In [ ]:
df1=pd.melt(df,id_vars=["day"])

In [ ]:
df1

          day variable  value
0      Monday  chicago     32
1     Tuesday  chicago     30
2   Wednesday  chicago     28
3    Thursday  chicago     22
4      Friday  chicago     30
5    Saturday  chicago     20
6      Sunday  chicago     25
7      Monday  chennai     75
8     Tuesday  chennai     77
9   Wednesday  chennai     75
10   Thursday  chennai     82
11     Friday  chennai     83
12   Saturday  chennai     81
13     Sunday  chennai     77
14     Monday   berlin     41
15    Tuesday   berlin     43
16  Wednesday   berlin     45
17   Thursday   berlin     38
18     Friday   berlin     30
19   Saturday   berlin     45
20     Sunday   berlin     47

In [ ]:
df1[df1['variable']=='chennai']

          day variable  value
7      Monday  chennai     75
8     Tuesday  chennai     77
9   Wednesday  chennai     75
10   Thursday  chennai     82
11     Friday  chennai     83
12   Saturday  chennai     81
13     Sunday  chennai     77

In [ ]:
melted = pd.melt(df, id_vars=["day"], var_name='city', value_name='temperature')
melted

          day     city  temperature
0      Monday  chicago           32
1     Tuesday  chicago           30
2   Wednesday  chicago           28
3    Thursday  chicago           22
4      Friday  chicago           30
5    Saturday  chicago           20
6      Sunday  chicago           25
7      Monday  chennai           75
8     Tuesday  chennai           77
9   Wednesday  chennai           75
10   Thursday  chennai           82
11     Friday  chennai           83
12   Saturday  chennai           81
13     Sunday  chennai           77
14     Monday   berlin           41
15    Tuesday   berlin           43
16  Wednesday   berlin           45
17   Thursday   berlin           38
18     Friday   berlin           30
19   Saturday   berlin           45
20     Sunday   berlin           47

In [ ]:
df_unmelted = melted.pivot(index='day', columns='city')
df_unmelted

          temperature
city           berlin chennai chicago
day
Friday             30      83      30
Monday             41      75      32
Saturday           45      81      20
Sunday             47      77      25
Thursday           38      82      22
Tuesday            43      77      30
Wednesday          45      75      28

In [ ]:
df_unmelted.columns = df_unmelted.columns.droplevel()

In [ ]:
df_unmelted

city       berlin  chennai  chicago
day
Friday         30       83       30
Monday         41       75       32
Saturday       45       81       20
Sunday         47       77       25
Thursday       38       82       22
Tuesday        43       77       30
Wednesday      45       75       28

In [ ]:
df_unmelted.index.name=None

In [ ]:
df_unmelted

city       berlin  chennai  chicago
Friday         30       83       30
Monday         41       75       32
Saturday       45       81       20
Sunday         47       77       25
Thursday       38       82       22
Tuesday        43       77       30
Wednesday      45       75       28

In [ ]:
df_unmelted.columns.name=None

In [ ]:
df_unmelted

           berlin  chennai  chicago
Friday         30       83       30
Monday         41       75       32
Saturday       45       81       20
Sunday         47       77       25
Thursday       38       82       22
Tuesday        43       77       30
Wednesday      45       75       28

In [ ]:
df_unmelted.reset_index()

       index  berlin  chennai  chicago
0     Friday      30       83       30
1     Monday      41       75       32
2   Saturday      45       81       20
3     Sunday      47       77       25
4   Thursday      38       82       22
5    Tuesday      43       77       30
6  Wednesday      45       75       28

In [ ]:
df=pd.read_csv('http://files.zillowstatic.com/research/public_v2/invt_fs/Metro_invt_fs_uc_sfrcondo_smoothed_month.csv')

In [ ]:
df.shape

(97, 46)

In [ ]:
df.head()

   RegionID  SizeRank  ... 2021-04-30 2021-05-31
0    102001         0  ...   953285.0   990307.0
1    394913         1  ...    59791.0    62039.0
2    753899         2  ...    20300.0    20784.0
3    394463         3  ...    33398.0    35885.0
4    394514         4  ...    21698.0    22710.0

[5 rows x 46 columns]

In [ ]:
df_new=pd.melt(frame=df,id_vars=['RegionID',	'SizeRank',	'RegionName',	'RegionType',	'StateName']
               ,var_name='year_val',value_name='count')

In [ ]:
df_new.head()

   RegionID  SizeRank  ...    year_val      count
0    102001         0  ...  2018-01-31  1430225.0
1    394913         1  ...  2018-01-31    69081.0
2    753899         2  ...  2018-01-31    20122.0
3    394463         3  ...  2018-01-31    42852.0
4    394514         4  ...  2018-01-31    24279.0

[5 rows x 7 columns]

# pivot

In [ ]:
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/pivot/weather.csv')

In [ ]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [ ]:
df[(df['city']=='mumbai') & (df['date']=='5/1/2017')]

       date    city  temperature  humidity
3  5/1/2017  mumbai           75        80

In [ ]:
df.pivot(index='city',columns='date')

         temperature                   humidity
date        5/1/2017 5/2/2017 5/3/2017 5/1/2017 5/2/2017 5/3/2017
city
beijing           80       77       79       26       30       35
mumbai            75       78       82       80       83       85
new york          65       66       68       56       58       60

In [ ]:
df_new=df.pivot(index='city',columns='date',values='humidity')

In [ ]:
df_new.index.name=None

In [ ]:
df_new

date      5/1/2017  5/2/2017  5/3/2017
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [ ]:
df_new.columns.name = None

In [ ]:
df_new

          5/1/2017  5/2/2017  5/3/2017
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [ ]:
df_new.loc['mumbai']

5/1/2017    80
5/2/2017    83
5/3/2017    85
Name: mumbai, dtype: int64

In [ ]:
df_new.loc['mumbai']['5/1/2017']

80

In [ ]:
df.pivot(index='date',columns='city')

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60

In [ ]:
df=pd.read_csv('/content/drive/MyDrive/FoDS-2021/data/pivot/weather2.csv')

In [ ]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [ ]:
df_new=df.pivot(index='city',columns='date',values='humidity')

ValueError: ignored

In [ ]:
df.pivot_table(index='city',columns='date')

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

In [ ]:
df.pivot_table(index="city",columns="date",aggfunc="sum")

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai        163      111         153      162
new york      110      122         126      142

In [ ]:
import numpy as np
df.pivot_table(index="city",columns="date", margins=True,aggfunc=np.sum) # "sum","diff","count","mean"(default)

         humidity               temperature
date     5/1/2017 5/2/2017  All    5/1/2017 5/2/2017  All
city
mumbai        163      111  274         153      162  315
new york      110      122  232         126      142  268
All           273      233  506         279      304  583

#encoding categorical data

In [ ]:
import pandas as pd

In [ ]:
# Define the headers since the data does not have any
headers = ["symboling", "normalized_losses", "make", "fuel_type", "aspiration",
           "num_doors", "body_style", "drive_wheels", "engine_location",
           "wheel_base", "length", "width", "height", "curb_weight",
           "engine_type", "num_cylinders", "engine_size", "fuel_system",
           "bore", "stroke", "compression_ratio", "horsepower", "peak_rpm",
           "city_mpg", "highway_mpg", "price"]

# Read in the CSV file and convert "?" to NaN
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/autos/imports-85.data",
                  header=None, names=headers, na_values="?" )
df.head()

   symboling  normalized_losses         make  ... city_mpg highway_mpg    price
0          3                NaN  alfa-romero  ...       21          27  13495.0
1          3                NaN  alfa-romero  ...       21          27  16500.0
2          1                NaN  alfa-romero  ...       19          26  16500.0
3          2              164.0         audi  ...       24          30  13950.0
4          2              164.0         audi  ...       18          22  17450.0

[5 rows x 26 columns]

In [ ]:
df.dtypes

symboling              int64
normalized_losses    float64
make                  object
fuel_type             object
aspiration            object
num_doors             object
body_style            object
drive_wheels          object
engine_location       object
wheel_base           float64
length               float64
width                float64
height               float64
curb_weight            int64
engine_type           object
num_cylinders         object
engine_size            int64
fuel_system           object
bore                 float64
stroke               float64
compression_ratio    float64
horsepower           float64
peak_rpm             float64
city_mpg               int64
highway_mpg            int64
price                float64
dtype: object

In [ ]:
obj_df = df.select_dtypes(include=['object']).copy()
obj_df.head()

          make fuel_type aspiration  ... engine_type num_cylinders fuel_system
0  alfa-romero       gas        std  ...        dohc          four        mpfi
1  alfa-romero       gas        std  ...        dohc          four        mpfi
2  alfa-romero       gas        std  ...        ohcv           six        mpfi
3         audi       gas        std  ...         ohc          four        mpfi
4         audi       gas        std  ...         ohc          five        mpfi

[5 rows x 10 columns]

In [ ]:
obj_df.isnull().sum()

make               0
fuel_type          0
aspiration         0
num_doors          2
body_style         0
drive_wheels       0
engine_location    0
engine_type        0
num_cylinders      0
fuel_system        0
dtype: int64

In [ ]:
obj_df['num_doors'].value_counts()

four    114
two      89
Name: num_doors, dtype: int64

In [ ]:
obj_df=obj_df.fillna({"num_doors":"four"})

In [ ]:
obj_df.isnull().sum()

make               0
fuel_type          0
aspiration         0
num_doors          0
body_style         0
drive_wheels       0
engine_location    0
engine_type        0
num_cylinders      0
fuel_system        0
dtype: int64

# Approach 1 - Find and Replace

In [ ]:
obj_df["num_cylinders"].value_counts()

four      159
six        24
five       11
eight       5
two         4
three       1
twelve      1
Name: num_cylinders, dtype: int64

In [ ]:
clean_df={"num_doors":{"four":4,"two":2},
          "num_cylinders":{"four":4,"six":6,"five":5,"eight":8,"two":2,"three":3,"twelve":12}}

In [ ]:
obj_df.replace(clean_df,inplace=True)

In [ ]:
obj_df.head()

          make fuel_type aspiration  ...  engine_type num_cylinders fuel_system
0  alfa-romero       gas        std  ...         dohc             4        mpfi
1  alfa-romero       gas        std  ...         dohc             4        mpfi
2  alfa-romero       gas        std  ...         ohcv             6        mpfi
3         audi       gas        std  ...          ohc             4        mpfi
4         audi       gas        std  ...          ohc             5        mpfi

[5 rows x 10 columns]

In [ ]:
obj_df.dtypes

make               object
fuel_type          object
aspiration         object
num_doors           int64
body_style         object
drive_wheels       object
engine_location    object
engine_type        object
num_cylinders       int64
fuel_system        object
dtype: object

# label encoder

In [ ]:
obj_df["body_style"]=obj_df["body_style"].astype("category")

In [ ]:
obj_df["body_style_cat"]=obj_df["body_style"].cat.codes

In [ ]:
obj_df.head()

          make fuel_type aspiration  ...  num_cylinders fuel_system body_style_cat
0  alfa-romero       gas        std  ...              4        mpfi              0
1  alfa-romero       gas        std  ...              4        mpfi              0
2  alfa-romero       gas        std  ...              6        mpfi              2
3         audi       gas        std  ...              4        mpfi              3
4         audi       gas        std  ...              5        mpfi              3

[5 rows x 11 columns]

#one hot encoder

In [ ]:
obj_df["drive_wheels"].value_counts()

fwd    120
rwd     76
4wd      9
Name: drive_wheels, dtype: int64

In [ ]:
pd.get_dummies(obj_df, columns=["drive_wheels"]).head()

          make fuel_type  ... drive_wheels_fwd  drive_wheels_rwd
0  alfa-romero       gas  ...                0                 1
1  alfa-romero       gas  ...                0                 1
2  alfa-romero       gas  ...                0                 1
3         audi       gas  ...                1                 0
4         audi       gas  ...                0                 0

[5 rows x 13 columns]

In [ ]:
pd.get_dummies(obj_df, columns=["body_style", "drive_wheels"], prefix=["body", "drive"]).head()

          make fuel_type aspiration  ...  drive_4wd drive_fwd drive_rwd
0  alfa-romero       gas        std  ...          0         0         1
1  alfa-romero       gas        std  ...          0         0         1
2  alfa-romero       gas        std  ...          0         0         1
3         audi       gas        std  ...          0         1         0
4         audi       gas        std  ...          1         0         0

[5 rows x 17 columns]

# Custom encoding

In [ ]:
obj_df["engine_type"].value_counts()

ohc      148
ohcf      15
ohcv      13
l         12
dohc      12
rotor      4
dohcv      1
Name: engine_type, dtype: int64

In [ ]:
import numpy as np

obj_df["OHC_Code"] = np.where(obj_df["engine_type"].str.contains("ohc"), 1, 0)

In [ ]:
obj_df["OHC_Code"].head(20)

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
15    1
16    1
17    1
18    0
19    1
Name: OHC_Code, dtype: int64

# SKlearn - scikit learn

In [ ]:
from sklearn.preprocessing import LabelEncoder

lb_make = LabelEncoder()
obj_df["make_code"] = lb_make.fit_transform(obj_df["make"])
obj_df[["make", "make_code"]].head(11)

           make  make_code
0   alfa-romero          0
1   alfa-romero          0
2   alfa-romero          0
3          audi          1
4          audi          1
5          audi          1
6          audi          1
7          audi          1
8          audi          1
9          audi          1
10          bmw          2

In [ ]:
from sklearn.preprocessing import LabelBinarizer

lb_style = LabelBinarizer()
lb_results = lb_style.fit_transform(obj_df["body_style"])
pd.DataFrame(lb_results, columns=lb_style.classes_).head()

   convertible  hardtop  hatchback  sedan  wagon
0            1        0          0      0      0
1            1        0          0      0      0
2            0        0          1      0      0
3            0        0          0      1      0
4            0        0          0      1      0